/*
******************* (C) COPYRIGHT 深圳金迈高智能科技有限公司 *******************
* 文件名称：drv_IR.h
* 描    述：红外遥控解码驱动接口
* 版    本：V0.0.1
* 作    者：Landon
* Q      Q：920639478
* 修改时间：2015/10/27
* 修改记录：
********************************************************************************
*/
#ifndef _DRV_IR_H_
#define _DRV_IR_H_

#ifdef DRV_IR_GLOBALS
#define DRV_IR_EXT
#else
#define DRV_IR_EXT  extern
#endif

/*********************************头文件包含***********************************/
#include <common.h>

/******************************************************************************/
#define IrInput   P04 //红外输入

/***************************************全局变量定义与声明*********************/
DRV_IR_EXT volatile u8 IrRecStep;    //接收步骤
DRV_IR_EXT volatile u8 IrRecCnt;     //接收时间计数
DRV_IR_EXT volatile u8 IrIndex;      //接收位数
DRV_IR_EXT volatile u8 IrRecFlag;    //接收完标志
DRV_IR_EXT volatile u8 Ir_Buff[4];   //接收缓冲区

/*******************************************************************************
函数名称：IR_IO_Init
函数功能：红外接收IO口初始化
入口参数：无
出口参数：无
调    用：外部调用
*******************************************************************************/
DRV_IR_EXT void IR_IO_Init(void);


/*******************************************************************************
函数名称：IR_Init
函数功能：红外接收初始化
入口参数：无
出口参数：无
调    用：外部调用
*******************************************************************************/
DRV_IR_EXT void IR_Init(void);


/*******************************************************************************
函数名称：IR_Decode
函数功能：红外解码:在定时中断里调用，定时周期为100us.
入口参数：无
出口参数：无
调    用：外部调用
*******************************************************************************/
DRV_IR_EXT void IR_Decode(void);



#endif//_DRV_IR_H_
